/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"


/*-------------------------------------------functions------------------------------------------*/
int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
       
    /* TIM8初始化 */
    tim8_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* TIM8启动计数，并使能更新事件中断 */
    bsp_tim8_start();
    
    while(1)
    {

    }  
}


