/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*------------------------------------------variables-------------------------------------------*/
uint32_t g_exti_gpio_flag = 0;

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{      
    /* 配置系统时钟 */
    system_clock_config(); 

    /* Systick初始化 */
    std_delay_init();

    /* LED初始化 */
    led_init();

    /* EXTI初始化 */
    exti_init();

    while (1)
    {
        /* 每按一次按键触发EXTI中断，LED1切换一次亮灭 */
        if (g_exti_gpio_flag == 1)
        {
            LED1_TOGGLE();
            g_exti_gpio_flag = 0;
        }
    } 
}










