/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
    
    /* LPTIM2 初始化 */
    lptim2_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* LPTIM2启动计数，并使能自动重载匹配中断 */
    bsp_lptim_start();

    while(1)
    {
       
    }
}

