/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"


/*-------------------------------------------functions------------------------------------------*/

int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();
    
    /* TIM3初始化 */
    tim3_init();
    
    /* TIM3通道1~通道4启动PWM输出 */
    bsp_tim3_output_start();
    
    while(1)
    {

    }  
}


