/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*--------------------------------------------variables-----------------------------------------*/
__IO uint8_t g_alarm_flag = 0;

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{
    /* 配置系统时钟 */
    system_clock_config(); 

    /* RTC时钟源选择LXTAL */
    rtc_clock_config();

    /* RTC在VCORE_AON域，可使用VCORE_AON复位清除所有寄存器状态 */

    /* 配置RTC日期时间 */
    bsp_rtc_datetime_config();

    /* 配置RTC闹钟 */
    bsp_rtc_alarm_config();
    
    /* 等待闹钟中断 */
    while(g_alarm_flag == 0); 

    while(1)
    {
    }
}
