/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
    
    /* LPTIM GPIO初始化 */
    gpio_init();
    
    /* LPTIM1初始化 */
    lptim1_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* LPTIM正交编码器模式中断方式启动计数 */
    bsp_lptim_encoder_start();
    
    while(1)
    {
    }
}

