/************************************************************************************************/
/**
* @file               comp_bsp.c
* @author             MCU Ecosystem Development Team
* @brief              COMP BSP驱动函数。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*-------------------------------------------includes-------------------------------------------*/
#include "comp_bsp.h"
#include "common.h"
/*-------------------------------------------functions------------------------------------------*/
/**
* @brief  查询方式获取比较器1输出结果
* @retval 无
*/
void bsp_comp1_poll(void)
{
    /* 正相电压高于反相 */
    if(std_comp_get_output_result(COMP1))
    {
        /* 点亮LED1 */
        LED1_ON();
    }
    /* 正相电压低于反相 */
    else
    {
        /* 熄灭LED1 */
        LED1_OFF();
    }
}

