/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*------------------------------------------functions-------------------------------------------*/
int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();
    
    /* 设置MCO输出RCH的16分频 */
    /* 此处为了演示TIM3的PWM输入功能，将MCO引脚与TIM3_CH1相连，
       用户也可以根据实际应用将外部频率与TIM3_IN连接            */
    bsp_rcc_mco_config();
    
    /* TIM3初始化 */
    tim3_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* TIM3启动计数，并使能捕获事件中断 */
    bsp_tim3_capture_start();
    
    while(1)
    {

    }  
}


