/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/

int main(void)
{
    /* 配置系统时钟 */
    system_clock_config(); 

    /* 初始化LED1 */
    led_init();

    /* Systick初始化 */
    std_delay_init();

    /* IWDG初始化 */
    iwdg_init();

    while(1)
    {
        /* 翻转LED1状态 */
        LED_RED_FLIP();

        /* 延时1500ms */
        std_delayms(1500);

        /* IWDG喂狗 */
        std_iwdg_refresh();
    }
}

