/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*------------------------------------------functions-------------------------------------------*/

int main(void)
{
    /* 配置系统时钟 */
    system_clock_config();
    
    /* 延时函数初始化 */
    std_delay_init();
    
    /* gpio初始化 */
    gpio_init();

    /* VBGR初始化 */
    vbgr_init();

    /* COMP1初始化 */
    comp1_init();
    
    while(1)
    {
        /* 查询方式获取比较器比较结果 */
        bsp_comp1_poll();
    }
}

