/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
    
    /* I2C1和LED GPIO初始化 */
    gpio_init();
    
    /* I2C1初始化为主模式 */
    i2c1_master_init();
    
    /* I2C1主机发送 */
    bsp_i2c1_master_send();
    
    /* I2C1主机接收 */
    bsp_i2c1_master_receive();
    
    /* 等待主机通信结束 */
    while(1)
    {
       
    }
}




