/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{
    /* 配置系统时钟 */
    system_clock_config();
    
    /* dma初始化 */
    dma_init();

    /* LPUART 通信IO口初始化 */
    gpio_init();
    
    /* LPUART 外设初始化 */
    lpuart_init();
    
    /* LPUART DMA发送 */
    bsp_lpuart_dma_tx();
    
    /* LPUART DMA接收 */
    bsp_lpuart_dma_rx();
    
    while(1)
    {
    }
}

