/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              本示例展示通过查询方式获取VTS通道的值，ADC单次扫描转换，配置1个通道(内部通道
*                     VTS)，软件触发ADC转换；间隔0.5s软件触发ADC转换，ADC采样10次(根据实际需求可调整
*                     采样次数)，再进行数据平均，提升采样精度，最后将VTS采样平均值转换成温度值，通
*                     过串口打印输出。
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*-------------------------------------------includes-------------------------------------------*/
#include "main.h"
/*-------------------------------------------variables------------------------------------------*/
__IO int32_t g_get_ts;
/*-------------------------------------------functions------------------------------------------*/
int main(void)
{
    /* 配置系统时钟 */
    system_clock_config();
    
    /* 延时函数初始化 */
    std_delay_init();
    
    /* GPIO初始化 */
    gpio_init();

    /* VREFBUF初始化 */
    vrefbuf_init();
    
    /* UART初始化 */
    uart_init();

    /* ADC初始化 */
    adc_init();

    while(1)
    {
        /* 获取温度值 */
        g_get_ts = bsp_get_ts_temperature();
        /* 串口打印输出当前温度值 */
        printf("\r\n Temperature = %d℃\r\n", g_get_ts);
        
        std_delayms(500);
    }
}

