/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              本示例展示中断方式处理ADC单次扫描转换，配置1个通道(外部通道PA3)，使能ADC转换完
*                     成中断；间隔0.5s软件触发ADC转换，ADC采样10次(根据实际需求可调整采样次数)，再进
*                     行数据平均，提升采样精度，最后将外部通道采样平均值转换成电压值。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*-------------------------------------------includes-------------------------------------------*/
#include "main.h"
/*-------------------------------------------variables------------------------------------------*/
__IO uint32_t g_voltage;

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{
    /* 配置系统时钟 */
    system_clock_config(); 
    
    /* 延时函数初始化 */
    std_delay_init();

    /* GPIO初始化 */
    gpio_init();

    /* VREFBUF初始化 */
    vrefbuf_init();

    /* ADC初始化 */
    adc_init();

    /* NVIC初始化 */
    nvic_init();

    while(1)
    {
        /* 获取通道采集电压 */
        g_voltage = bsp_get_channel_voltage();
        
        /* 等待500ms */
        std_delayms(500);
    } 
}

