/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"


/*-------------------------------------------functions------------------------------------------*/

int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();

    /* GPIO初始化 */
    gpio_init();    
           
    /* TIM3初始化 */
    tim3_init();
        
    /* 使能单脉冲模式 */
    std_tim_onepulse_enable(TIM3);    
    std_tim_ccx_channel_enable(TIM3, TIM_CHANNEL_1);
    
    /* 等待触发单脉冲 */
    while(1)
    {

    }  
}


