/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/

int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
    
    /* I2C1和LED GPIO初始化 */
    gpio_init();
    
    /* I2C1初始化为从模式 */
    i2c1_slave_init();
    
    /* NVIC初始化 */
    nvic_init();
    
    /* I2C1中断配置 */
    bsp_i2c1_interrupt_config();
    
    /* LED1常亮，指示从机就绪 */
    LED1_ON();
    
    while(1)
    {
       
    }
}




