/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                           
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/


/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/

int main(void)
{    
    /* 配置系统时钟 */
    system_clock_config();
   
    /* GPIO初始化 */
    gpio_init();
    
    /* TIM3、TIM5初始化 */
    tim3_init();
    tim5_init();
    
    /* TIM3输入通道使能 */
    bsp_tim3_intput_start();
    
    /* TIM3、TIM5输出通道使能 */
    bsp_tim3_output_start();
    bsp_tim5_output_start();
    
    /* 等待触发信号有效 */
    while(1)
    {
       
    }
}

