/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"


/*-------------------------------------------functions------------------------------------------*/

int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
    
    /* GPIO初始化 */
    gpio_init();
    
    /* TIM4初始化 */
    tim4_init();
    
    /* UART4初始化 */
    uart4_init();
    
    /* IRTIM初始化 */
    irtim_init();
    
    /* 控制IRTIM调制解调红外信号 */
    bsp_irtim_modulation();
    
    while(1)
    {

    }  
}


