/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              本示例展示通过BGR的出厂参数和BGR采样值，计算ADC的参考电压的电压值。ADC对BGR采样
*                     10次(根据实际需求可调整采样次数)，再进行数据平均，提升采样精度，最后使用平均值
*                     校准ADC当前的参考电压。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*------------------------------------------variables-------------------------------------------*/
__IO uint32_t g_get_voltage;

/*------------------------------------------functions-------------------------------------------*/
int main(void)
{
    /* 配置系统时钟 */
    system_clock_config(); 
    
    /* 延时函数初始化 */
    std_delay_init();
    
    /* VBGR初始化 */
    vbgr_init();

    /* ADC初始化 */
    adc_init();

    /* 获取采样值并校准参考电压值，单位mV*/
    g_get_voltage = bsp_get_channel_voltage();
    
    while(1)
    {

    }
}
