/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              应用程序主流程。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*-------------------------------------------functions------------------------------------------*/
int main(void)
{   
    /* 配置系统时钟 */
    system_clock_config();
    
    /* RTC初始化，RTC时钟源为LXTAL */
    rtc_clock_config();
    
    /* 配置RTC时钟输出信号 */
    bsp_rtc_out_config();
    
    
    /* 手动切换供电电压为VBAT后，RTC正常输出256Hz */    
    
    while(1)
    {
       
    }
}




