/************************************************************************************************/
/**
* @file               main.c
* @author             MCU Ecosystem Development Team
* @brief              该示例展示查询的方式处理ADC单次扫描转换，配置1个通道(外部通道PA3),软件触发ADC转换，
*                     ADC采样10次(根据实际需求可调整采样次数)，再进行数据平均，提升采样精度，最后将外部
*                     通道采样平均值转换成电压值。
*                     
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/*------------------------------------------includes--------------------------------------------*/
#include "main.h"

/*------------------------------------------variables-------------------------------------------*/
__IO uint32_t g_get_voltage;

/*------------------------------------------functions-------------------------------------------*/
int main(void)
{
    /* 配置系统时钟 */
    system_clock_config(); 
    
    /* 延时函数初始化 */
    std_delay_init();

    /* GPIO初始化 */
    gpio_init();
    
    /* VREFBUF初始化 */
    vrefbuf_init();

    /* ADC初始化 */
    adc_init();

    /* 获取采样值并转换为电压值，单位mV*/
    g_get_voltage = bsp_get_channel_voltage(ADC_CHANNEL_2);
    
    while(1)
    {

    }
}
