/************************************************************************************************/
/**
* @file               ciu32l051_std_tamp.c
* @author             MCU Ecosystem Development Team
* @brief              TAMP STD库驱动。
*                     实现了TAMP的去初始化API。
*
*
**************************************************************************************************
* @attention
* Copyright (c) CEC Huada Electronic Design Co.,Ltd. All rights reserved.
*
**************************************************************************************************
*/

/************************************************************************************************/
/**
* @addtogroup CIU32L051_STD_Driver
* @{
*/

/**
* @addtogroup TAMP 
* @{
*
*/
/************************************************************************************************/


/*------------------------------------------includes--------------------------------------------*/
#include "ciu32l051_std.h"

#ifdef STD_TAMP_PERIPHERAL_USED

/*-------------------------------------------functions------------------------------------------*/

/************************************************************************************************/
/**
* @addtogroup TAMP_External_Functions 
* @{
*
*/
/************************************************************************************************/ 

/**
* @brief  TAMP去初始化 
* @note   调用该函数前应先调用std_pmu_vaon_write_enable()，解除AWON域写保护
* @retval 无
*/
void std_tamp_deinit(void)
{
    /* 寄存器恢复至复位值 */ 
    TAMP->ENR   = 0x00000000U;
    TAMP->CR    = 0x00000000U;
    TAMP->FLTCR = 0x00000000U;
    TAMP->IER   = 0x00000000U;
    
    /* 清除SR、ISR中标志 */
    TAMP->CLR   = 0xFFFFFFFFU;
    
    /* 清除备份寄存器 */
    TAMP->BKP0R = 0x00000000U;
    TAMP->BKP1R = 0x00000000U;
    TAMP->BKP2R = 0x00000000U;
    TAMP->BKP3R = 0x00000000U;
    TAMP->BKP4R = 0x00000000U;
}

/** 
* @} 
*/

#endif /* STD_TAMP_PERIPHERAL_USED */

/** 
* @} 
*/

/** 
* @} 
*/
